<template>
<div id="algo">
<h2>AI算法</h2>
<p>在讲解AI革命之前， 我们要先弄明白一个东西叫算法。 说到算法， 你可能会想到程序。在计算机出现的初期， 我们就试图把人类的知识，比如计算， 放入到计算机里，然后通过程序来解决问题， 这个东西我们通常称之为算法。我们可以说AI革命前的计算机时代， 算法已经在全面的改变我们的生活。算法首先表达的是人类的逻辑， 通常可以被数学公式，或者是某种符号语言表达。然后我们通过晶体管精密的运作方式表达这种逻辑， 然后帮助人类来工作。
</p>
<p>
具体理解什么是算法， 一个非常典型的例子， 排序就是一个很经典的算法， 杂乱无章的数字堆在一起， 我们要一从大到小给它排列出来。然后， 我们会规定一个过程， 让这串数据进去， 然后整齐从大到小的出来，这就是一个算法。 我们可以如何做呢？ 有无数种方法， 最简单的让每个数据从左到右与旁边数据比较，每次遇到比自己大的， 就右移一格， 遇到不如自己的， 就不动，这样下来， 然后那个小的继续比较， 这样最小的那个就沉到最后， 这样再对剩下的数处理， 往复循环，就可以从小到大的出来。 当然我们可以发明无数过程实现这个东西，比如插入法， 堆排序等，但是万变不离其综的是， 一个可以自动实现的过程， 每一步按照一定规则行进，得到一个我们想要的结果。我们可以看到算法是把人的逻辑过程给自动化了。
</p>

<p>
进一步想， 算法其实也并不一定是程序。 通过一个给定的规则和自动化的过程得到一个结果，只要是这件事，有没有计算机都可以看成算法。比如生物进化可以看作一个巨大的遗传进化算法，一开始有一堆原始的细胞， 然后你规定一个过程，细胞可以通过遗传产生一样的新细胞， 这个过程会有错误出现变异， 然后自然环境可以选择有利的变异， 只要迭代论述足够多， 这个算法得到的结果是所有复杂的生命类型。一些社会现象， 如自由市场对经济的调控， 也可以看作算法，你自己可以回去想下。
</p>

<p>
这告诉我们， 算法是分层次的， 最上层的， 是符号世界的算法也就是一个数学体系， 最下层的， 是物理世界的部分。因为算法本身其实是一大堆可以被操作的符号的一个抽象的变换过程， 但是当它落到计算机程序上， 其实就被转化为一大堆晶体管的开开闭闭， 这就是物理实现的层次。 当然如果硬要说两者之间也还有一个层次，也就是程序员在计算机上的代码， 一方面它属于符号世界的具体化，因为同一个算法你可以用python也可以用java， 一方面它又高于硬件层， 同一个程序你可以在不同计算机上跑吗。 这可以看作程序层。
</p>

<p>
因此我们可以不停的把人或者自然的算法输入到计算机，让计算机帮我们完成这些事。大到我们可以把牛顿定律输入到电脑里，帮我们计算登月飞船的轨道， 也可以把狄拉克方程放进去， 帮我们调节加速器的电磁场， 小到写一个管理公司账目的程序， 让电脑管理我们的账户。
</p>

<p>
而AI革命建立在算法革命之上的， 却超越之， 为什么呢？ AI算法与一般程序算法的区别在于什么？就是AI算法可以看作是让计算机自己来写算法的算法， 写程序的程序。 所谓generative algorithm， 何为能够写程序的程序， AI算法之前的程序， 实质上做的是按人类的指令做计算，当你指定了在某个大小的螺母里放进一个螺钉，它就是会那么一直做下去， 而现代的AI算法呢？ 我们说当下的AI算法本质上寻找的是那个螺钉和螺母两者间的匹配法则，如果尺寸不合适， 我如何去自己换一个。这样的好处是什么， 如果这个世界螺钉和螺母匹配的方法只有一个， 那么或许我们还是可以用老办法一个个的写出来，但是如果这个匹配的方法多种多样，因不同的国家而不同， 那么我们写好一个AI算法， 就等于一次解决了所有的匹配问题， 相当于10行代码， 可以产生之前几千行，几万行的效果。
</p>

<p>
这说的还是有点抽象了，快速的思考， 你就把每个AI算法看成一个小机器人，它能够通过数据， 学到某中人的能力，比如做匹配， 把某男和某女的特征输入给它， 它就知道合不合适。这个匹配的方法在不同国家不一样， 但是只要你有足够数据， AI就会精准的找到这个匹配法则。 对， 没错， 你要让它学习， 你就要给它数据，AI算法从数据里总结规律。
</p>

<p>
这仅仅是第一步， AI算法要学习的，是学习整个人类的学习能力。 一旦计算机掌握了这个能力，它就可以掌管越来越多只有人类才能掌管的事情。 这意味着什么？ 那些几千年来我们认为的最卓越的人类脑力劳动， 计划， 决策， 甚至发明创造， 都可以逐步的被机器取代。当它变得越来越强大和细腻，它甚至会比你更了解你自己， 成为每个人的主宰者。
</p>
        <Comment article_id="2"/>
    </div>
</template>

<script>
	import Comment from '@/components/Comment.vue'
    export default {
		name: "algo",
        components: {
            Comment
		},
    }
</script>

<style scoped>
</style>
