<template>
<div id="story1">
<h2>被重新定义的人类健康</h2>
<p>
想象20年后的一天早上，你大脑上带着的智能睡眠检测系统会根据你的脑电波图，根据你晚上经过的睡眠周期，确定是否该把你叫醒，然后你在徐徐启动的音乐里，一点点苏醒，开始你美妙的一天。
</p><p>
我们睡醒之后， 智能手环已经检测到了你今天你的血液指标，根据你最近进食的记录和偏好， 给你选好了适宜的早餐，发送指令给厨用机器人做好。 吃早餐的时候，会根据你最近的血液成分记录， 你的长期信息偏好， 给你呈现上个性化定制的早餐。这个原理， 跟上面是一样的。
</p><p>
由于又到了每周的体检时间， 个人电脑会提示你吃完早点到离你最近的体检中心进行检测了。 检测中心里， 你从大脑到身体的所有系数都被计算一遍， 然后根据超级计算机里你的计算机情况， 检测到你一个5年后你获得胃癌的风险， 巨大的模拟器开始启动， 模拟不同的病情风险调控方案下， 你会得到的结果， 几亿次模拟之后，一个最佳的推荐方案已经形成。 这个方案包含了整个几年你的饮食和运动计划， 将潜在风险降到最小。 这样， 由于一些致命的疾病几乎被消除了， 人的寿命会变得极长，配合器官更换一类的技术， 我们甚至会开始攻克死亡。 然而不幸的是， 由于贫富分化是存在的， 这些最新技术一定是用于最富有和有权利的人， 所以， 人类最终将不仅仅是财富的分化，而是生理的分化， 变成两个物种。
</p><p>
分析： 技术上， 像睡眠，饮食这一类生活中最基本的事情，我们说在今天的时代似乎与算法和数据无关， 事实上，这些东西的一点一滴都和算法有关。比如人的大脑， 这台由一千亿个神经元组成的宇宙间最复杂的机器，事实上是一大堆生物算法的集合。 你虽然接受这台精密仪器的指令， 你却事实上对他一无所知。（比如人在睡梦中形成和固化前一天的记忆…. ）对于人脑这样复杂的机器的真正管理在AI时代成为可能。 为什么？ 首先，AI算法通过传感器（核磁， EEG）获取人脑的数据，然后它们可以很有效的利用AI算法学到这些传感器的数据与我们的大脑认知功能状态的关系， 比如你处在什么样的睡眠周期。然后， 这些AI算法就可以做到控制， 比如在你的睡眠周期那个最适合苏醒的阶段叫醒你。
</p><p>
我们的身体也是一样，在21世纪以前， 即使是最精确的西医，对身体的毛病， 也是坏哪修哪的一种修机器的逻辑。而AI算法一旦介入，我们的身体数据会事实的计入到检测数据中，模型可以根据整个身体的各个参数的实时检测任何病症的风险，来预测所有需要在前期做到的预备工作。
</p><p>
因此技术是可行的。 至于是否会像未来简史的作者Uval担心的那样将人类分成两个物种，我认为这样的可能并不大， 因为数据有关的技术从一个人迁移到另一个人成本不大。 正是因为有了AI的远程医疗系统， 有些非常贫穷的地区目前可以接受到最先进地区的诊疗效果，这点上看AI是在消除不平等。
</p>
        <Comment article_id="3"/>
    </div>
</template>

<script>
	import Comment from '@/components/Comment.vue'
    export default {
		name: "story1",
        components: {
            Comment
		},
    }
</script>

<style scoped>
</style>