<template>
    <div id="story">
        <div class="page-wrap">
            <mt-tab-container :value="selected">
                <mt-tab-container-item id="story_1">
                    <h2>被重新定义的人类健康</h2>
                    <p>
                        想象20年后的一天早上，你大脑上带着的智能睡眠检测系统会根据你的脑电波图，根据你晚上经过的睡眠周期，确定是否该把你叫醒，然后你在徐徐启动的音乐里，一点点苏醒，开始你美妙的一天。
                    </p>
                    <p>
                        我们睡醒之后， 智能手环已经检测到了你今天你的血液指标，根据你最近进食的记录和偏好， 给你选好了适宜的早餐，发送指令给厨用机器人做好。 吃早餐的时候，会根据你最近的血液成分记录，
                        你的长期信息偏好，
                        给你呈现上个性化定制的早餐。这个原理， 跟上面是一样的。
                    </p>
                    <p>
                        由于又到了每周的体检时间， 个人电脑会提示你吃完早点到离你最近的体检中心进行检测了。 检测中心里， 你从大脑到身体的所有系数都被计算一遍， 然后根据超级计算机里你的计算机情况，
                        检测到你一个5年后你获得胃癌的风险，
                        巨大的模拟器开始启动， 模拟不同的病情风险调控方案下， 你会得到的结果， 几亿次模拟之后，一个最佳的推荐方案已经形成。 这个方案包含了整个几年你的饮食和运动计划， 将潜在风险降到最小。 这样，
                        由于一些致命的疾病几乎被消除了， 人的寿命会变得极长，配合器官更换一类的技术， 我们甚至会开始攻克死亡。 然而不幸的是， 由于贫富分化是存在的， 这些最新技术一定是用于最富有和有权利的人，
                        所以，
                        人类最终将不仅仅是财富的分化，而是生理的分化， 变成两个物种。
                    </p>
                    <p>
                        分析： 技术上， 像睡眠，饮食这一类生活中最基本的事情，我们说在今天的时代似乎与算法和数据无关， 事实上，这些东西的一点一滴都和算法有关。比如人的大脑，
                        这台由一千亿个神经元组成的宇宙间最复杂的机器，事实上是一大堆生物算法的集合。 你虽然接受这台精密仪器的指令， 你却事实上对他一无所知。（比如人在睡梦中形成和固化前一天的记忆….
                        ）对于人脑这样复杂的机器的真正管理在AI时代成为可能。 为什么？ 首先，AI算法通过传感器（核磁，
                        EEG）获取人脑的数据，然后它们可以很有效的利用AI算法学到这些传感器的数据与我们的大脑认知功能状态的关系，
                        比如你处在什么样的睡眠周期。然后， 这些AI算法就可以做到控制， 比如在你的睡眠周期那个最适合苏醒的阶段叫醒你。
                    </p>
                    <p>
                        我们的身体也是一样，在21世纪以前， 即使是最精确的西医，对身体的毛病，
                        也是坏哪修哪的一种修机器的逻辑。而AI算法一旦介入，我们的身体数据会事实的计入到检测数据中，模型可以根据整个身体的各个参数的实时检测任何病症的风险，来预测所有需要在前期做到的预备工作。
                    </p>
                    <p>
                        因此技术是可行的。 至于是否会像未来简史的作者Uval担心的那样将人类分成两个物种，我认为这样的可能并不大， 因为数据有关的技术从一个人迁移到另一个人成本不大。
                        正是因为有了AI的远程医疗系统，
                        有些非常贫穷的地区目前可以接受到最先进地区的诊疗效果，这点上看AI是在消除不平等。
                    </p>
                    <img alt="medicare" src="../../static/story1.jpg">
                </mt-tab-container-item>
                <mt-tab-container-item id="story_2">
                    <h2>机器指引下的社交</h2>
                    <p>
                        你是一个不善交际的AI程序员， 早上写了两小时程序， 你的大脑监控仪早已发现了你有效率减低趋势，于是， 它建议你出去走走。
                        一辆自动驾驶的清洁能源车早已停在了门口，它决定带你到颐和园里走一趟，当然如果你不满意只要在地点选项上稍微调整一下就好了，于是车辆启动，前往目的地。
                    </p>
                    <p>
                        在公园里， 你的个人助理系统知道你平时很宅但其实喜欢邂逅， 于是它迅速与目前处在公园里的异性的个人AI助理进行沟通， 匹配双方的数据，然后计算得到了一个最佳的邂逅对象，
                        双方电脑达成共识给主人发送一条信息。
                        于是一场欢乐的邂逅就开始了。
                    </p>
                    <img alt="img" src="../../static/2.png">
                    <p>
                        当然不善言辞的你见到她感到有点紧张， 没关系， 个人助理跟据对方的性格， 已经给你做好了聊天提示， 你啥事变得十分健谈。由于这样的浪漫邂逅太多太容易， 我们已经不愿意去和一人结婚终老，
                        而是享受这种U盘式的邂逅关系。
                    </p>
                    <p>
                        甚至由于助理机器人的功能过于强大， 很多宅男和她聊天就已经不愿意接触人类了。
                    </p>
                    <p>
                        分析： 这个故事是展示AI对人类社交可能产生的影响， 人与人的最佳匹配变得太过容易， 会不会最后动摇了婚姻家庭等各类最基础的人类关系纽带。
                        倘若一段关系的开始，仅仅是在你的个人助理app里发出一条请求，
                        还会有人需要长久的关系吗？
                    </p>
                </mt-tab-container-item>
                <mt-tab-container-item id="story_3">
                    <h2>空无一人的车间</h2>
                    <p>
                        我们再从人类社会尺度来看这个美丽新世界。 机器， 已经普遍的存在在了所有以前认为只有个体才完成的职位上。我们看到空无一人的汽车生产线，空无一人的医院， 即使是最精妙的技艺，
                        配备了最好的视觉和听觉识别系统，
                        经过了多轮强化学习的机器也可以娴熟的完成。 那你要问劳动者在什么地方？都在玩啊，除了几个极为聪明的AI工程师。
                    </p>
                    <img alt="worker" src="../../static/story3.jpg">
                    <p>
                        分析： 这可能是你听到的公号上最多的一个故事， 关于自动化和失业。 我个人认为，首先这样一个故事真正实现的历程会很漫长，再有， 就算有那么多AI占领 了工厂的流水线，
                        就有更多的人进入到整个AI的生产线里，这并不仅仅包含程序员， 还包括需要大量检测AI在各种情况下行为合理性的人，
                        就拿无人驾驶情况看，一辆新的无人驾驶车出来，那么它可能和之前车不一样的就不仅仅是发动机，
                        还有行为规则， 比如在各种特殊情况下是选择保守还是效率 ， 那么单纯对AI行为的管理就要有多少设计师呢。还有有些人可能会变成AI分析家，
                        比如柯洁已经开始想从阿法狗那里探讨围棋的真谛了。
                    </p>
                    <p>
                        退一步讲， 即使AI真的取代了大量取代了人的工作， 也不是人类末日，人类并非一定为工作而生， 有很多可以给人生活以意义的事情， 那么如何制造一个低工作但是高幸福度的社会或许就是那时候新的课题吧
                        。
                    </p>

                </mt-tab-container-item>
                <mt-tab-container-item id="story_4">
                    <h2>机器控制的人生</h2>
                    <p>
                        既然大部分的产业， 甚至政府的主要功能， 都已经被AI去掉，那我们自然的会问， 人类在干什么。事实上， 这个时候最有用的职业可能是哲学家， 因为他们最喜欢的讨论是人生的意义何在，
                        这可是在这个时代非常有意义的话题，
                        因为我们的生活的主要决策既然都可以大量的交给AI算法， 人存在的意义又何在，除了那些极个别的设计算法的天才外， 你， 作为一个普通人， 存在的意义何再？ 在几十年前，
                        你起码可以说我就是我的自由意志， 我思故我在，
                        我动故我在，而现在，你大脑里的每一个脉冲都被机器记录， 然后它比你预先的知道你想要去哪里， 会和谁dating，
                        如果机器想控制你，那么只要按照一定的方法引导你的多巴胺信号，就会让你不知不觉的成为你不想成为的人。
                        这样的世界不是太可怕了吗？ 你存在和意义何在？ 所以在这样的一个世界里， 哲学家或心理学家成为了非常好的职业，他或许会不停的引导你如果你去发挥你在某个方面的才干， 你会创作出一些好的艺术品，
                        比如你可以去写小说，
                        去画画， 你连续的创造和提升， 或许就是你的生命意义。
                    </p>
                    <p>
                        分析：这里的观点认为创作永远属于人的领地， 但从AI算法发展角度看，不一定。当下的gan技术，
                        已经能够模拟人创作一些具有固定艺术风格的画，如果未来结合了阿法狗里用到的强化学习，那么说不定超越了简单的摹仿大家作品，
                        而是在不同的大家作品里寻找出人类创作的进化规律， 去不停的产生新的能够取悦于人的艺术风格。
                    </p>
                    <p>
                        那么科学创造呢？ 是的， 我们说科学创造是人类历史的长河里，
                        建立在大量经验之上的灵感火花带来的突破性创新，波普尔认为这些科技成果的出现甚至是没有太多的可预测性，由于科技进步的偶然性，带来了人类历史进程的不确定性。
                        然而在真正的AI时代， 这也可能发生改变， 除了相对论这一类的非常接近哲学的研究，大量的实验学课，比如药物的设计， 会被机器取代， 因为这一类学科的探索取决于大量试错，
                        这个试错过程让AI来做远比人高的多，
                        所以未来，大量的高效药物， 可能会是AI设计出来的， 而你所做的汽车，飞机从形状曲线， 到材料选择， 也都来自于AI。
                    </p>
                    <p>
                        当然， 那些相对论，进化论级别的发现呢？ 这也许并非AI一时所能级，因为本质上这些东西需要AI建立对世界的整个认知系统， 和最关键的，对自我的认知，
                        即使是21世纪初期的脑科学，也对这些一无所知，
                        而如果这些都有一天被突破， 那么我们所面临的就已经面临的不是人的存在意义与否的问题， 而是人类本身是否还需要存在了。 既然这个基本问题一时是没有答案了，我们也就不需要太过焦虑这个问题了。
                    </p>
                    <img alt="picture drew by AI" src="../../static/story4.jpg">
                </mt-tab-container-item>
            </mt-tab-container>
        </div>


        <mt-tabbar fixed v-model="selected">
            <mt-tab-item id="story_1">
                <img alt="icon" slot="icon" src="../../static/medical_pill.png">
                被重新定义的人类健康
            </mt-tab-item>
            <mt-tab-item id="story_2">
                <img slot="icon" src="../../static/social_media.png">
                机器指引下的社交
            </mt-tab-item>
            <mt-tab-item id="story_3">
                <img slot="icon" src="../../static/factory.png">
                空无一人的车间
            </mt-tab-item>
            <mt-tab-item id="story_4">
                <img slot="icon" src="../../static/life.png">
                机器控制的人生
            </mt-tab-item>
        </mt-tabbar>
        <read :sound="require('../../static/audios/'+selected+'.mp3')"/>
    </div>
</template>

<script>
    import read from "../../components/mobile/read";

    export default {
        name: "mobileStory",
        components: {read},
        layout: "mobile",
        data() {
            return {
                selected: "story_1",
            }
        }
    }
</script>

<style scoped>
    h2 {
        color: #6d727c;
        text-align: center;
    }

    .page-wrap {
        overflow: auto;
        height: 100%;
        padding-bottom: 100px;
        width: 90vw;
        margin-left: auto;
        margin-right: auto;
    }

    img {
        width: 100%;
    }
</style>